package by.tce.jonline.modul4;

/* Модуль 4. Простейшие классы и объекты. Задача 1
 * Создайте класс Test1 с двумя переменными. Добавьте метод вывода на экран и методы изменения 
 * этих переменных. Добавьте метод, который находит сумму значений этих переменных, и метод,
 * который находит наибольшее значение из этих двух переменных.
 */

public class Main {

	public static void main(String[] args) {
		
		Test1 test1 = new Test1();
		test1.setVar(2, 3);
		test1.show();

	}

}
